start_message = 'Для початку вибери свою групу |⤵'
group_text = 'Вибери свою групу |⤵'
hi_text = '👋| Вітання!\n\n' \
          "🤖| Цей бот призначений для допомоги студентам <b>ЛТЕУ факультету комп'ютерних наук</b>.\n" \
          '🧾| Він буде сповіщати Вас про <b>розклад пар щодня</b> і коротко інформувати Вас про пари наступного дня.\n' \
          '📌| Свої ідеї для розширення функціонала бота присилайте адміністратору.\n\n' \
          '⚠️| <b>Адміністратор бота @pumesiN, про всі проблеми прошу інформувати його в першу чергу.</b> |⚠️'
day_text = 'Вибери день тижня |⤵'

b_notification = '📢| Повідомлення |📢'
b_on_off = '🟩| Увімкнути / Вимкнути |🟥'
on_ntfc = '⚠️| Ви увімкнули повідомлення!'
off_ntfc = '⚠️| Ви вимкнули повідомлення!'

group_change = 'Ви змінили групу на {}-у'

a_hi = 'Добрий день!'
a_sdl = 'Вибери групу'

b_hight_math = 'Вища математика |👨‍🎓'
b_disc_math = '👨‍🎓| Дискретна  математика'
b_timetable = '📝| Розклад |📝'
b_settings = '⚙| Налаштування |⚙'
b_admin = '👨‍💻| Адмін-меню |👨‍💻'

b_sdl = 'Редагувати розклад'
a_sdl_pair = 'Вибери пару для редагування'
a_sdl_housing = 'Вибери місце розташування'
a_sdl_num = 'Введи номер кабінету, або посилання до Zoom.'

b_presets = 'Пресети'
b_prst_lc = 'Тиждень лекцій'
b_prst_pr = 'Тиждень практики'
a_prst_lc = 'Ви змінили тиждень на лекційний'
a_prst_pr = 'Ви змінили тиждень на практичний'

b_newsletter = 'Розсилка'
a_newsletter = 'Надрукуй і відправ текст'
b_send_news = 'Відправити'

b_menu_chosen = 'Вибери категорію |⤵️'

b_group = '📊| Вибір групи |📊'

error_func = '🙅| Функція тимчасово недоступна'
error_text = '⚠️| Користуйтесь клавіатурою!'
b_cancel = 'Відміна'
b_delete = 'Видалити'
b_back = 'Назад'

# РОЗКЛАД

hi_pre = '📢| Добрий вечір! Інформація про першу пару на завтра.\n\n'
hi = '📢| Добрий ранок. Розклад пар сьогодні:\n\n'

pre = '<b>{}</b>\n' \
      '🏫| Корпус: <b>{}</b>\n' \
      '🕣| Початок: <b>{}</b>\n' \
      '🕜| Кінець пар: <b>{}</b>\n' \
      '🗿| Пар всього: <b>{}</b>'

lesson_office = '📊| Офісне програмне забезпечення'
lesson_eng = '🇬🇧| Іноземна мова'
lesson_eco = '💰| Макроекономіка'
lesson_disk = '👨‍🎓| Дискретна  математика'
lesson_math = '👨‍🎓| Вища математика'
lesson_prog = '👨‍💻| Алгоритмізація та програмування'
lesson_hist = '📜| Історія української державності'
lesson_pculture = '🏀| Фізичне виховання'

p1 = '1️⃣| Перша пара: <b>пари немає</b>'
p2 = '2️⃣| Друга пара: <b>пари немає</b>'
p3 = '3️⃣| Третя пара: <b>пари немає</b>'
p4 = '4️⃣| Четверта пара: <b>пари немає</b>'
p5 = "5️⃣| П'ята пара: <b>пари немає</b>"
p6 = '6️⃣| Шоста пара: <b>пари немає</b>'
