faculty_message = 'Для початку вибери свій факультет |⤵'
faculty_confirm = 'Твій факультет - '
group_message = 'Тепер вибери свою групу |⤵'
group_confirm = 'Твоя група - '
group_change = 'Зміна групи!'
type_confirm = 'Тип тижня (lc - лекції; pr - практика) - '

hi_text = '👋| Вітання!\n\n' \
          "🤖| Цей бот призначений для допомоги студентам <b>ЛТЕУ факультету комп'ютерних наук</b>.\n" \
          '🧾| Він буде сповіщати Вас про <b>розклад пар щодня</b> і коротко інформувати Вас про пари наступного дня.\n' \
          '📌| Свої ідеї для розширення функціонала бота присилайте адміністратору.\n\n' \
          '⚠️| <b>Адміністратор бота @pumesiN, про всі проблеми прошу інформувати його в першу чергу.</b> |⚠️'

day_text = 'Вибери день тижня |⤵'

schedule_gp1 = 'Розклад для 151 групи\n\n'
schedule_gp2 = 'Розклад для 152 групи\n\n'
schedule_gp3 = 'Розклад для 153 групи\n\n'

b_notification = '📢| Повідомлення |📢'
b_on_off = '🟩| Увімкнути / Вимкнути |🟥'
on_ntfc = '⚠️| Ви увімкнули повідомлення!'
off_ntfc = '⚠️| Ви вимкнули повідомлення!'

a_hi = 'Добрий день!'
a_sdl_fac = 'Вибери факультет'
a_sdl_group = 'Вибери групу'

b_hight_math = 'Вища математика |👨‍🎓'
b_disc_math = '👨‍🎓| Дискретна  математика'
b_timetable = '📝| Розклад |📝'
b_settings = '⚙| Налаштування |⚙'
b_admin = '👨‍💻| Адмін-меню |👨‍💻'

b_sdl = 'Редагувати розклад'
b_sdl_add = 'Додати пару'
a_sdl = 'Вибери дію |⤵️'
a_sdl_type = 'Вибери тип пари'
a_sdl_pair = 'Вибери пару для редагування'
a_sdl_name = 'Введи назву пари'
a_sdl_start = 'Введи час початку пари'
a_sdl_end = 'Введи час кінця пари'
a_sdl_housing = 'Введи місце проведення пари'
a_sdl_result = 'Підтвердіть введену інформацію:\n {}: {} | {} - {} | {}'
b_sdl_confirm_end = 'Підтвердити і вийти'
b_sdl_confirm_return = 'Підтвердити і додати наступну пару'
success = 'Операція пройшла успішно!'

b_presets = 'Пресети'
b_prst_lc = 'Лекції'
b_prst_pr = 'Практика'
a_prst_lc = 'Ви змінили тиждень на лекційний'
a_prst_pr = 'Ви змінили тиждень на практичний'

b_newsletter = 'Розсилка'
a_newsletter = 'Надрукуй і відправ текст'
b_send_news = 'Відправити'

b_menu_chosen = 'Вибери категорію |⤵️'

b_group = '📊| Вибір групи |📊'

error_func = '🙅| Функція тимчасово недоступна'
error_text = '⚠️| Користуйтесь клавіатурою!'
b_cancel = 'Відміна'
b_delete = 'Видалити'
b_back = 'Назад'

# РОЗКЛАД

hi_pre = '📢| Добрий вечір! Інформація про першу пару на завтра.\n\n'
hi = '📢| Добрий ранок. Розклад пар сьогодні:\n\n'

pre = '<b>{}</b>\n' \
      '🏫| Корпус: <b>{}</b>\n' \
      '🕣| Початок: <b>{}</b>\n' \
      '🕜| Кінець пар: <b>{}</b>\n' \
      '🗿| Пар всього: <b>{}</b>'

monday = 'Понеділок'
tuesday = 'Вівторок'
wednesday = 'Середа'
thursday = 'Четвер'
friday = "П'ятниця"
saturday = 'Субота'

pair_name = [
    'Перша пара',
    'Друга пара',
    'Третя пара',
    'Четверта пара',
    "П'ята пара",
    'Шоста пара'
]

pairs_forms = [
    '1️⃣| {}: <b>{} | {} | {}</b>\n\n',
    '2️⃣| {}: <b>{} | {} | {}</b>\n\n',
    '3️⃣| {}: <b>{} | {} | {}</b>\n\n',
    '4️⃣| {}: <b>{} | {} | {}</b>\n\n',
    "5️⃣| {}: <b>{} | {} | {}</b>\n\n",
    '6️⃣| {}: <b>{} | {} | {}</b>\n\n'
]

